app/views/articles/_form.html.erb

  <p>
    <%= collection_check_boxes(:article, :author_ids, Author.all, :id, :last_name) %>
---
SELECT "authors".* FROM "authors"

  <p>
    <%= collection_check_boxes(:article, :tag_ids, Tag.all, :id, :name) %>
---
SELECT "tags".id FROM "tags" WHERE "tags"."article_id" = ?  [[nil, 1]]