app/views/articles/show.html.erb

  by
  <% @article.authors.each do |author| %>
---
SELECT "authors".* FROM "authors" INNER JOIN "article_authors" ON "authors"."id" = "article_authors"."author_id" WHERE "article_authors"."article_id" = ?  [["article_id", 1]]

  <ul>
    <% @article.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ?  [["article_id", 1]]