app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "News!"], ["body", "News is great!"], ["created_at", "2016-03-28 05:59:59.046518"], ["updated_at", "2016-03-28 05:59:59.046518"]]
---
  def create
    puts "Creating article..."
    @article = Article.new(article_params)
    if @article.save